app/controllers/admin_controller.rb

        def connexion
            @admins = Admin.all
---
SELECT "admins".* FROM "admins"

        def index
          @admins = Article.all
---
SELECT "articles".* FROM "articles"

        def show
          @admin = Article.find(params[:id])
          @comments = @admin.comments.all
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]