app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE "articles"."online" = ? ORDER BY "articles"."updated_at" DESC  [["online", "t"]]
---
    def index
      #session[:user] = {id: '123', username: 'Regit05'}
      @articles = Article.online(true).by_updated_at.all

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 10]]
---
    def show
      #@article = Article.find(params[:id])
      #@session = session[:user]
      @comments = @article.comments.all

UPDATE "articles" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", "erting"], ["text", "tnd"], ["updated_at", "2017-10-10 13:07:43.264919"], ["id", 6]]
---
    def update
      #@article = Article.find(params[:id])

      if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 7]]
---
    def destroy
      #@article = Article.find(params[:id])
      @article.destroy

INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test"], ["text", "test"], ["created_at", "2017-10-03 12:50:44.698518"], ["updated_at", "2017-10-03 12:50:44.698518"]]
---
    def create
      #render plain: params[:article].inspect

      #@article = Article.new(params.require(:article).permit(:title,:text))
      @article = Article.new(article_params)
      #@article.save
      #redirect_to @article

      if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."online" = ? AND ("articles"."title" LIKE '%g%') ORDER BY "articles"."updated_at" DESC  [["online", "t"]]
---
    def search
        #render plain: params[:search].inspect
        @articles = Article.online(true).where(Article.arel_table[:title].matches("%#{params[:search]}%")).by_updated_at