app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("name", "email", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Contact1"], ["email", "email1"], ["message", "message1"], ["created_at", "2017-12-10 20:38:26.369662"], ["updated_at", "2017-12-10 20:38:26.369662"]]